import os

TOKEN = os.getenv("TOKEN")

# ==========================
# 서버 설정
# ==========================

REVIEW_CHANNEL_NAME = "후기"
LOG_CHANNEL_NAME = "구매로그"

ANNOUNCE_CHANNEL_ID = 1505562851824369714

BUYER_ROLE_ID = 1505076370332586155
CUSTOMER_ROLE_ID = 1505074732700008531


# ==========================
# 개발자 ID
# ==========================

DESIGNERS = {
    "gfx": {
        1468584582113919129: "🎨 GFX 디자이너",
        1465051418162626763: "🎨 GFX 디자이너"
    },

    "logo": {
        1292859064065458189: "🖼️ 로고 디자이너"
    },

    "uniform": {
        375938495350571009: "👕 복장 디자이너"
    }
}